# Set up

In [1]:
import pandas as pd
import numpy as np
import json

# Data Structures

## Series
A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.The simplest Series is formed from only an array of data
The string representation of a Series displayed interactively shows the index on the left and the values on the right

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# You can get the array representation of the Series via its values
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
# You can get index object of the Series via its index attributes
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# It is desirable to create a Series with an index identifying each data point
# with a label:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
# Compared with NumPy arrays, you can use labels in the index when selecting single
# values or a set of values:

obj2['a']

-5

In [8]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

Here ['c', 'a', 'd'] is interpreted as a list of indices, even though it contains
strings instead of integers

### Series dict

Another way to think about a Series is as a fixed-length, ordered dict, 
as it is a mapping of index values to data values. 
It can be used in many contexts where you might use a dict:

In [9]:
'b' in obj2

True

In [10]:
 'e' in obj2

False

Should you have data contained in a Python dict, you can create a Series from it by passing the dict

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

When you are only passing a dict, the index in the resulting Series will have the dict’s
keys in sorted order. You can override this by passing the dict keys in the order you
want them to appear in the resulting Series:

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Since no value for 'California' was found, it appears as NaN (not a number), which is considered in pandas to mark missing or NA values. Since 'Utah' was not included in states, it is excluded from the resulting object.

#### Missing values

The isnull and notnull functions in pandas should be used to detect missing data:

In [13]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [15]:
# Series also has these as instance methods:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

#### Index alignment

In [16]:
# A useful Series feature for many applications is that it automatically aligns by index
# label in arithmetic operations:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

This is similar to a SQL join operation

Both the Series object itself and its index have a name attribute, which integrates with
other key areas of pandas functionality

In [19]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [20]:
# A Series’s index can be altered in-place by assignment
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [21]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## Dataframe

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string,boolean, etc.).
 The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index

In [22]:
# Constructing a dataframe
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

In [23]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
# For large DataFrames, the head method selects only the first five rows:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

### Columns

In [25]:
# If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [26]:
# If you pass a column that isn’t contained in the dict, it will appear with missing values in the result:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                        index=['one', 'two', 'three', 'four',
                                'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [27]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [28]:
# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [29]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [30]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

##### Columns can be modified by assignment. 
For example, the empty 'debt' column 
could be assigned a scalar value or an array of values:

In [31]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [32]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

##### When you are assigning lists or arrays to a column, the value’s length must match 
the 
length of the DataFrame.
 If you assign a Series, its labels will be realigned exactly to
the DataFrame’s index, inserting missing values in any holes:

In [33]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

##### Assigning a column that doesn’t exist will create a new column. .

In [34]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

##### The del keyword will delete columns as with a dict.

In [35]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

### Nested dicts

In [36]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys
# as the columns and the inner keys as the row indices:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

You can transpose the DataFrame (swap rows and columns) with similar syntax to a
NumPy array:

In [37]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

The keys in the inner dicts are combined and sorted to form the index in the result.
This isn’t true if an explicit index is specified:

In [38]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Dicts of Series are treated in much the same way:

In [39]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

##### If a DataFrame’s index and columns have their name attributes set, 
these will also be
displayed:

In [40]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

As with Series, the values attribute returns the data contained in the DataFrame as a
two-dimensional ndarray:

In [41]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

## Index Objects
pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index:

In [42]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user:

In [43]:
index[1] = 'd'

TypeError: Index does not support mutable operations

Immutability makes it safer to share Index objects among data structures:

In [44]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [45]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [46]:
obj2.index is labels

False

Unlike Python sets, a pandas Index can contain duplicate labels:

In [47]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Essential Functionality

## Reindex

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index

In [48]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [49]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present

## Methods

For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values:

In [50]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [51]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

The bfill method fills backwards:

In [52]:
obj4 = pd.Series(['red', 'gray', 'purple'], index=[0, 2, 4])
obj4

0       red
2      gray
4    purple
dtype: object

In [53]:
obj4.reindex(range(6), method='bfill')

0       red
1      gray
2      gray
3    purple
4    purple
5       NaN
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [54]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

  state  year  pop
a   NaN   NaN  NaN
b   NaN   NaN  NaN
c   NaN   NaN  NaN
d   NaN   NaN  NaN

The columns can be reindexed with the columns keyword:

In [55]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [56]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

You can reindex more succinctly by label-indexing with loc:

## Dropping Entries from an Axis

The drop method will return a new object with the indicated value or values deleted from
an axis:

In [57]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [58]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [59]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

Calling drop with a sequence of labels will drop values from the row labels (axis 0):

In [60]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can drop values from the columns by passing axis=1 or axis='columns':

In [62]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [63]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Many functions, like drop, which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [64]:
# inplace destroys any data that is dropped.
obj.drop('c', inplace=True)

In [65]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## Indexing, Selection, and Filtering

### Series indexing

Series indexing (obj[...]) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers

In [66]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [67]:
obj['b']

1.0

In [68]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [69]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [70]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [71]:
 obj[[1, 3]]

C:\Users\Eliud\AppData\Local\Temp\ipykernel_9820\306961484.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end‐
point is inclusive:

In [72]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Setting using these methods modifies the corresponding section of the Series:

In [73]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

### Dataframe indexing

Indexing into a DataFrame is for retrieving one or more columns either with a single
value or sequence:

In [74]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [76]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [77]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [78]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Indexing with a boolean DataFrame:

In [79]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [80]:
data[data < 5] = 0

In [81]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc).

In [82]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [83]:
 data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [84]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [85]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both indexing functions work with slices in addition to single labels or lists of labels:

In [86]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [87]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

To keep things consistent, if you have an axis index containing integers, data selection
will always be label-oriented. For more precise handling, use loc (for labels) or iloc
(for integers):

In [88]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [89]:
ser.iloc[:1]

0    0.0
dtype: float64

In [90]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

## Arithmetic and Data Alignment

When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the
index pairs. This is similar to an automatic outer
join on the index labels

In [92]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [93]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [94]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [95]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don’t
overlap. Missing values will then propagate in further arithmetic computations.

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [96]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [97]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [98]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [99]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
as all missing in the result. The same holds for the rows whose labels are not common
to both objects:

If you add DataFrame objects with no column or row labels in common, the result
will contain all nulls:

In [100]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [101]:
df1

   A
0  1
1  2

In [102]:
df2

   B
0  3
1  4

In [103]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other:

In [104]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

In [105]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [106]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [107]:
# Adding these together results in NA values in the locations that don’t overlap:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [108]:
# Using the add method on df1, I pass df2 and an argument to fill_value:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill
value:

In [109]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Each of the methods has a counterpart, starting with the letter r, that has arguments flipped:

In [110]:
# these two statements are equivalent:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [111]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

#### Operations between DataFrame and Series

In [112]:
arr = np.arange(12.).reshape((3, 4))

In [113]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [114]:
arr[0]

array([0., 1., 2., 3.])

When we subtract arr[0] from arr, the subtraction is performed once for each row.
This is referred to as broadcasting

In [115]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

Operations between a DataFrame and a Series are
similar:

In [116]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [117]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [118]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series
on the DataFrame’s columns, broadcasting down the rows:

In [119]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrame’s columns or the Series’s index,
the objects will be reindexed to form the union:

In [122]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [123]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods:

In [124]:
series3 = frame['d']

In [125]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [128]:
# The axis number that you pass is the axis to match on. In this case we mean to match
# on the DataFrame’s row index (axis='index' or axis=0) and broadcast across.
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [129]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.294466  0.723042 -0.222222
Ohio   -0.454355  2.092844  0.230452
Texas  -0.137666 -0.157533  0.215780
Oregon  0.927056 -1.311570  0.333396

In [130]:
np.abs(frame)

               b         d         e
Utah    0.294466  0.723042  0.222222
Ohio    0.454355  2.092844  0.230452
Texas   0.137666  0.157533  0.215780
Oregon  0.927056  1.311570  0.333396

Another frequent operation is applying a function on one-dimensional arrays to each
column or row. DataFrame’s apply method does exactly this:

In [131]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.381411
d    3.404415
e    0.555618
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series hav‐
ing the columns of frame as its index
If you pass axis='columns' to apply, the function will be invoked once per row
instead:

In [132]:
frame.apply(f, axis='columns')

Utah      1.017508
Ohio      2.547199
Texas     0.373313
Oregon    2.238627
dtype: float64

- Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.
- The function passed to apply need not return a scalar value; it can also return a Series
with multiple values:

In [134]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.454355 -1.311570 -0.222222
max  0.927056  2.092844  0.333396

Use map to compute a formatted string from each floating-point value in frame

In [137]:
# The applymap method is deprecated
format = lambda x: '%.2f' % x
frame.map(format)

            b      d      e
Utah    -0.29   0.72  -0.22
Ohio    -0.45   2.09   0.23
Texas   -0.14  -0.16   0.22
Oregon   0.93  -1.31   0.33

In [139]:
frame['e'].map(format)

Utah      -0.22
Ohio       0.23
Texas      0.22
Oregon     0.33
Name: e, dtype: object

## Sorting and Ranking

### Sort

Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

In [140]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [141]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [142]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [143]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [144]:
# The data is sorted in ascending order by default, but can be sorted in descending
# order, too:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [145]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [146]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [147]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort
keys. To do so, pass one or more column names to the by option of sort_values:

In [148]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [149]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [150]:
# To sort by multiple columns, pass a list of names:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### Ranking

Ranking assigns ranks from one through the number of valid data points in an array.
The rank methods for Series and DataFrame are the place to look; by default rank
breaks ties by assigning each group the mean rank:

In [153]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the
data:

In [154]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [155]:
# You can rank in descending order, too:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame can compute ranks over the rows or the columns:

In [156]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [157]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

In [159]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index’s is_unique property can tell you whether its labels are unique or not:

In [163]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates.
Indexing a label with multiple entries returns a Series, while single entries return a
scalar value:

In [160]:
obj['a']

a    0
a    1
dtype: int64

In [161]:
obj['c']

4

This can make your code more complicated, as the output type from indexing can
vary based on whether a label is repeated or not.
The same logic extends to indexing rows in a DataFrame:

In [164]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.761730  0.093202  0.062804
a -1.200973  1.208816 -1.516381
b  0.881778  1.147400  0.528709
b -0.802250  0.574768  0.073760

In [165]:
df.loc['a']

          0         1         2
a -0.761730  0.093202  0.062804
a -1.200973  1.208816 -1.516381

# Data Loading, Storage, and File Formats

### Read & write csv

In [189]:
df = pd.read_csv('mytopartists.csv')

In [190]:
df

                                 Artist  StreamCount
0                         Playboi Carti        19256
1                                  Yeat        17131
2                        Destroy Lonely         8791
3                         Homixide Gang         4728
4                            Ken Carson         3733
..                                  ...          ...
995                 The Weather Company            4
996  The Weeknd, Playboi Carti, Madonna            4
997                              Tony22            4
998                       Vince Staples            4
999                        Vintage Clan            4

[1000 rows x 2 columns]

In [210]:
# First 5 rows
df.head()

           Artist  StreamCount
0   Playboi Carti        19256
1            Yeat        17131
2  Destroy Lonely         8791
3   Homixide Gang         4728
4      Ken Carson         3733

In [211]:
# Specify rows
df.head(10)

           Artist  StreamCount
0   Playboi Carti        19256
1            Yeat        17131
2  Destroy Lonely         8791
3   Homixide Gang         4728
4      Ken Carson         3733
5          Future         3417
6      Kanye West         3034
7     Lancey Foux         2751
8  UnoTheActivist         2525
9  Pi’erre Bourne         2446

In [212]:
# Last 5 rows
df.tail()

                                 Artist  StreamCount
995                 The Weather Company            4
996  The Weeknd, Playboi Carti, Madonna            4
997                              Tony22            4
998                       Vince Staples            4
999                        Vintage Clan            4

#### Info and Describe

In [213]:
# Summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Artist       1000 non-null   object
 1   StreamCount  1000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [214]:
# Statistical summary of numerical columns
df.describe()

        StreamCount
count   1000.000000
mean     114.847000
std      915.404126
min        4.000000
25%        6.000000
50%       10.000000
75%       24.000000
max    19256.000000

If you want to only read a small number of rows (avoiding reading the entire file),
specify that with nrows:

In [193]:
dfrow = pd.read_csv('mytopartists.csv', nrows=10)
dfrow

           Artist  StreamCount
0   Playboi Carti        19256
1            Yeat        17131
2  Destroy Lonely         8791
3   Homixide Gang         4728
4      Ken Carson         3733
5          Future         3417
6      Kanye West         3034
7     Lancey Foux         2751
8  UnoTheActivist         2525
9  Pi’erre Bourne         2446

Using DataFrame’s to_csv method, we can write the data out to a comma-separated
file:

In [197]:
dfrow.to_csv('Top10.csv', index=False)

In [198]:
pd.read_csv('Top10.csv')

           Artist  StreamCount
0   Playboi Carti        19256
1            Yeat        17131
2  Destroy Lonely         8791
3   Homixide Gang         4728
4      Ken Carson         3733
5          Future         3417
6      Kanye West         3034
7     Lancey Foux         2751
8  UnoTheActivist         2525
9  Pi’erre Bourne         2446

### JSON Data

JSON (short for JavaScript Object Notation) has become one of the standard formats
for sending data by HTTP request between web browsers and other applications. It is
a much more free-form data format than a tabular text form like CSV

In [199]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [201]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

json.dumps, on the other hand, converts a Python object back to JSON:

In [202]:
asjson = json.dumps(result)

In [203]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

The pandas.read_json can automatically convert JSON datasets in specific arrangements into a Series or DataFrame. For example:

In [204]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

### XML and HTML

In [205]:
tables = pd.read_html('Amazon.com_laptops.html')

The pandas.read_html function has a number of options, but by default it searches
for and attempts to parse all tabular data contained within <table> tags. The result is
a list of DataFrame objects:

In [206]:
tables

[                                                  0   1   \
 0              Amazon Music Stream millions of songs NaN
 1                                                NaN NaN
 2  Amp Host your own live radio show with music y... NaN
 3                                                NaN NaN
 4                      IMDb Movies, TV & Celebrities NaN
 5                                                NaN NaN
 6                   Ring Smart Home Security Systems NaN

                                                   2   3   \
 0  Amazon Advertising Find, attract, and engage c... NaN
 1                                                NaN NaN
 2           AmazonGlobal Ship Orders Internationally NaN
 3                                                NaN NaN
 4  IMDbPro Get Info Entertainment Professionals Need NaN
 5                                                NaN NaN
 6            eero WiFi Stream 4K Video in Every Room NaN

                                                   4   5   \
 0                  6pm Score deals on fashion brands NaN
 1                                                NaN NaN
 2  Home Services Experienced Pros Happiness Guara... NaN
 3                                                NaN NaN
 4  Kindle Direct Publishing Indie Digital & Print... NaN
 5                                                NaN NaN
 6                Blink Smart Security for Every Home NaN

                                                   6   7   \
 0                 AbeBooks Books, art & collectibles NaN
 1                                                NaN NaN
 2  Amazon Web Services Scalable Cloud Computing S... NaN
 3                                                NaN NaN
 4    Prime Video Direct Video Distribution Made Easy NaN
 5                                                NaN NaN
 6      Neighbors App Real-Time Crime & Safety Alerts NaN

                                                   8   9   \
 0                 ACX Audiobook Publishing Made Easy NaN
 1                                                NaN NaN
 2  Audible Listen to Books & Original Audio Perfo... NaN
 3                                                NaN NaN
 4                    Shopbop Designer Fashion Brands NaN
 5                                                NaN NaN
 6  Amazon Subscription Boxes Top subscription box... NaN

                                            10  11  \
 0      Sell on Amazon Start a Selling Account NaN
 1                                         NaN NaN
 2  Box Office Mojo Find Movie Box Office Data NaN
 3                                         NaN NaN
 4                 Woot! Deals and Shenanigans NaN
 5                                         NaN NaN
 6                PillPack Pharmacy Simplified NaN

                                              12
 0  Amazon Business Everything For Your Business
 1                                           NaN
 2      Goodreads Book reviews & recommendations
 3                                           NaN
 4                       Zappos Shoes & Clothing
 5                                           NaN
 6                                           NaN  ]

### Excel

To use ExcelFile, create an instance by passing a path to an xls or xlsx file:

In [209]:
pd.read_excel('Largest_companies.xlsx', 'Sheet1')

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

### Interacting with Web APIs

### Interacting with Databases